src/ex_bp3/Documents/ПоступлениеНаРасчетныйСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ПоступлениеНаРасчетныйСчет</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаУслуг</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаУслуг</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_bp3/Documents/ПоступлениеНаРасчетныйСчет/Ext/ObjectModule.bsl
&После("ПередЗаписью")
Процедура TBK_BP_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если не ЗначениеЗаполнено(СуммаУслуг) тогда
		
		//Вик 2021_03_15 проставляем сумма банковской комиссии. Скопировано из УТ
		Если ЗначениеЗаполнено(НазначениеПлатежа) тогда
			СтрокаРазбора	=	НазначениеПлатежа;
			
			СимволыКомиссия = Найти(НРег(СтрокаРазбора),"комиссия");
			СимволыВозврат  = Найти(НРег(СтрокаРазбора),"возврат");
			
			ПозицияМерчанта	=	Найти(НРег(СтрокаРазбора),"мерчант");	
			Если  ПозицияМерчанта <> 0 тогда
				ДлинаКомиссии	 = СимволыВозврат - СимволыКомиссия - 11;
			иначе
				ДлинаКомиссии	 = СимволыВозврат - СимволыКомиссия - 12;
			КонецЕсли;

			Если СимволыКомиссия > 0 и ДлинаКомиссии > 0 тогда
				Попытка
					СуммаКомиссии	=	Число(СтрЗаменить(Сред(СтрокаРазбора,СимволыКомиссия + 9,ДлинаКомиссии),",",""));	
					СуммаУслуг		=	СуммаКомиссии;
					Если РасшифровкаПлатежа.Количество() = 1 тогда
						РасшифровкаПлатежа[0].СуммаУслуг	=	СуммаУслуг;	
					КонецЕсли;
					
					//это может еще пригодится
					//Если  ПозицияМерчанта = 0 тогда
					//	СтрокаДокумента.Мерчант	=	Число(Сред(СтрокаРазбора,19,12));
					//иначе
					//	СтрокаДокумента.Мерчант	=	Число(Сред(СтрокаРазбора,ПозицияМерчанта+9,12));
					//КонецЕсли;
					//
					//Если Найти(БанковскийСчет.Наименование,"ИНТЕЗА")>0 тогда
					//	Если  ПозицияМерчанта = 0 тогда
					//		НужнаяПозиция						= Найти(НРег(СтрокаРазбора),"эквайринг за");
					//		СтрокаДата							= Сред(СтрокаРазбора,НужнаяПозиция + 13,10);
					//		ДатаИзСтроки						= Дата(Число(Прав(СтрокаДата,4)),Сред(СтрокаДата,4,2),Лев(СтрокаДата,2),0,0,0);
					//		СтрокаДокумента.ФактДатаЭквайринга	= ДатаИзСтроки;

					//	иначе
					//		НужнаяПозиция						= Найти(НРег(СтрокаРазбора),"дата реестра");
					//		СтрокаДата							= Сред(СтрокаРазбора,НужнаяПозиция + 13,10);
					//		ДатаИзСтроки						= Дата(Число(Прав(СтрокаДата,4)),Сред(СтрокаДата,4,2),Лев(СтрокаДата,2),0,0,0);
					//		СтрокаДокумента.ФактДатаЭквайринга	= ДатаИзСтроки - 24*60*60;
					//		
					//	КонецЕсли;
					//иначе
					//	СтрокаДата							= СтрокаДокумента.Дата;
					//	ДатаИзСтроки						= Дата(Число(Прав(СтрокаДата,4)),Сред(СтрокаДата,4,2),Лев(СтрокаДата,2),0,0,0);
					//	СтрокаДокумента.ФактДатаЭквайринга	= ДатаИзСтроки - 24*60*60;
					//КонецЕсли; 
				Исключение
					Сообщить(ОписаниеОшибки());							
				КонецПопытки;
			КонецЕсли;					
		КонецЕсли;
		//КонецВик	
	КонецЕсли;
КонецПроцедуры
